tap "jandedobbeleer/oh-my-posh"
tap "nikitabobko/tap"
brew "openssl@3"
brew "bat"
brew "btop"
brew "cask"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "imagemagick"
brew "jq"
brew "lazygit"
brew "mole"
brew "neovim"
brew "nmap"
brew "node"
brew "powershell"
brew "python@3.12"
brew "ripgrep"
brew "rustscan"
brew "starship"
brew "stow"
brew "tmux"
brew "tree"
brew "uv"
brew "zplug"
brew "zsh-syntax-highlighting"
brew "jandedobbeleer/oh-my-posh/oh-my-posh"
cask "nikitabobko/tap/aerospace"
cask "arc"
cask "balenaetcher"
cask "bitwarden"
cask "brave-browser"
cask "copilot-cli"
cask "db-browser-for-sqlite"
cask "discord"
cask "firefox@developer-edition"
cask "ghostty"
cask "google-chrome"
cask "hiddenbar"
cask "maccy"
cask "obsidian"
cask "postman"
cask "shottr"
cask "spotify"
cask "stats"
cask "steam"
cask "visual-studio-code"
cask "wireshark-app"
vscode "github.copilot-chat"
vscode "ms-azuretools.vscode-containers"
vscode "ms-vscode-remote.remote-containers"
uv "dutyy"
uv "net-scan"
uv "posting"
